ERP.belugaerp/src/DataProcessors/бг_АктуализацияДвиженийПоАкцизам/бг_АктуализацияДвиженийПоАкцизам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>бг_АктуализацияДвиженийПоАкцизам</name>
</mdclass:DataProcessor>

ERP.belugaerp/src/AccumulationRegisters/бг_АкцизПоПриобретеннымЦенностям/бг_АкцизПоПриобретеннымЦенностям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_АкцизПоПриобретеннымЦенностям</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.битРасчетАвансовПоАкцизам</types>
      <types>CatalogRef.бг_БанковскиеГарантии</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеСырья</name>
    <type>
      <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеОплатыАванса</name>
    <type>
      <types>CatalogRef.бг_СостоянияОплатыАванса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусАкциза</name>
    <type>
      <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтАрендодателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратМатериаловИзКладовой</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыпускПродукцииНаСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОказаниеАгентскихУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВСоставОС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаМатериаловВКладовую</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаМатериаловВПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОприходованиеЗаСчетДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаПродукцииИзПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПолуфабрикатов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуОС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПринятиеКУчетуПредметовАренды</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияВнеоборотныхАктивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияЧерезКомиссионераБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеРасходовНаПартииПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоставкаПодПринципала</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализацииУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеализацииУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеБезнадежнойЗадолженностиЗаСчетРезервовПоСомнительнымДолгам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НачислениеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияУменьшениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПриобретенияУвеличениеЗадолженностиСводно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНалогов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВидыЛицензийАлкогольнойПродукции/ВидыЛицензийАлкогольнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыЛицензийАлкогольнойПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Спирт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СпиртосодержащаяПищеваяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/DataProcessors/бг_АктуализацияДвиженийПоАкцизам/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементовСогласноОперации();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОперацияПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементовСогласноОперации();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АктуализироватьДвижения(Команда)
	АктуализироватьДвиженияНаСервере(Период.ДатаНачала, Период.ДатаОкончания, Организация,
											Номенклатура, СерияНоменклатуры, Сделка,
											Продукция, СерияПродукции);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаменуСделки(Команда)
	Если Не ЗначениеЗаполнено(Сделка)
		Или Не ЗначениеЗаполнено(СделкаЗамена) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить данные замены'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ВыполнитьЗаменуСделкиНаСервере(Сделка, СделкаЗамена, ПТУ);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвижения(Команда)
	Если Не ЗначениеЗаполнено(ТипОбъектов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны типы документов для которых требуется сформировать движения'"));
		Возврат;
	КонецЕсли;
	
	СформироватьДвиженияНаСервере(ТипОбъектов, Организация, Период.ДатаНачала, Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвиженияПоДням(Команда)
	СформироватьДвиженияПоДнямНаСервере(Организация, Период.ДатаНачала, Период.ДатаОкончания);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементовСогласноОперации()
	Если Операция = 0 Тогда
		Элементы.СтраницыОперации.ТекущаяСтраница = Элементы.СтраницаПересчетДвижений;
		Элементы.АктуализироватьДвижения.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Операция = 1 Тогда
		Элементы.СтраницыОперации.ТекущаяСтраница = Элементы.СтраницаЗаменаСделки;
		Элементы.ВыполнитьЗаменуСделки.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.СтраницыОперации.ТекущаяСтраница = Элементы.СтраницаФормированиеДвижений;
		Элементы.СформироватьДвижения.КнопкаПоУмолчанию = Истина;
		Элементы.ТипОбъектов.Видимость  = Операция = 2;
	КонецЕсли;
	
	Элементы.АктуализироватьДвижения.Видимость    = Операция = 0;
	Элементы.ВыполнитьЗаменуСделки.Видимость      = Операция = 1;
	Элементы.СформироватьДвижения.Видимость       = Операция = 2;
	Элементы.СформироватьДвиженияПоДням.Видимость = Операция = 3;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьДвиженияНаСервере(ДатаНачала, ДатаОкончания, Организация,
											Номенклатура, СерияНоменклатуры, Сделка,
											Продукция, СерияПродукции)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АкцизПоПриобретеннымЦенностям.Организация КАК Организация,
	|	АкцизПоПриобретеннымЦенностям.Номенклатура КАК Номенклатура,
	|	АкцизПоПриобретеннымЦенностям.СерияНоменклатуры КАК СерияНоменклатуры,
	|	АкцизПоПриобретеннымЦенностям.Сделка КАК Сделка,
	|	АкцизПоПриобретеннымЦенностям.СостояниеСырья КАК СостояниеСырья,
	|	АкцизПоПриобретеннымЦенностям.СостояниеОплатыАванса КАК СостояниеОплатыАванса,
	|	АкцизПоПриобретеннымЦенностям.СтатусАкциза КАК СтатусАкциза,
	|	АкцизПоПриобретеннымЦенностям.Продукция КАК Продукция,
	|	АкцизПоПриобретеннымЦенностям.СерияПродукции КАК СерияПродукции
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК АкцизПоПриобретеннымЦенностям
	|ГДЕ
	|	АкцизПоПриобретеннымЦенностям.Период >= &НачалоПериода
	|	И (АкцизПоПриобретеннымЦенностям.Период <= &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))
	|	И (АкцизПоПриобретеннымЦенностям.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (АкцизПоПриобретеннымЦенностям.Номенклатура = &Номенклатура
	|			ИЛИ &Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И (АкцизПоПриобретеннымЦенностям.СерияНоменклатуры = &СерияНоменклатуры
	|			ИЛИ &СерияНоменклатуры = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|	И (АкцизПоПриобретеннымЦенностям.Сделка = &Сделка
	|			ИЛИ &Сделка = НЕОПРЕДЕЛЕНО)
	|	И (АкцизПоПриобретеннымЦенностям.Продукция = &Продукция
	|			ИЛИ &Продукция = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И (АкцизПоПриобретеннымЦенностям.СерияПродукции = &СерияПродукции
	|			ИЛИ &СерияПродукции = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))";
	Запрос.УстановитьПараметр("НачалоПериода",     ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",      ДатаОкончания);
	Запрос.УстановитьПараметр("Организация",       Организация);
	Запрос.УстановитьПараметр("Номенклатура",      Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("Сделка",            ?(ЗначениеЗаполнено(Сделка), Сделка, Неопределено));
	Запрос.УстановитьПараметр("Продукция",         Продукция);
	Запрос.УстановитьПараметр("СерияПродукции",    СерияПродукции);
	Результат = Запрос.Выполнить();
	
	Обработки.бг_АктуализацияДвиженийПоАкцизам.ВосстановитьПоследовательностьДвижений(
		Результат.Выгрузить(),
		ДатаНачала,
		ДатаОкончания);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьЗаменуСделкиНаСервере(Сделка, СделкаЗамена, ПТУ)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Акциз.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.бг_АкцизПоПриобретеннымЦенностям КАК Акциз
	|ГДЕ
	|	Акциз.Сделка = &Сделка
	|	И (&Регистратор = НЕОПРЕДЕЛЕНО
	|			ИЛИ Акциз.Регистратор = &Регистратор)
	|	И НЕ ТИПЗНАЧЕНИЯ(Акциз.Регистратор) В (&ИсключаемыеТипыДокументов)";
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("Регистратор", ?(ЗначениеЗаполнено(ПТУ), ПТУ, Неопределено));
	Запрос.УстановитьПараметр("ИсключаемыеТипыДокументов", ИсключаемыеТипыДокументовЗаменаСделки());
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	НачатьТранзакцию();
	
	Попытка
		Пока Выборка.Следующий() Цикл
			ЗаблокироватьДанныеДляРедактирования(Выборка.Регистратор);
			
			ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
			ЗаменитьСделку(ДокументОбъект, Сделка, СделкаЗамена);
			ЗаменитьСделкуДвижения(ДокументОбъект.Ссылка, Сделка, СделкаЗамена);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ПТУ) Тогда
			ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПТУ, "Дата, Организация");
			АктуализироватьДвиженияНаСервере(ДанныеДокумента.Дата, '00010101', ДанныеДокумента.Организация,
								Справочники.Номенклатура.ПустаяСсылка(), Справочники.СерииНоменклатуры.ПустаяСсылка(), Сделка,
								Справочники.Номенклатура.ПустаяСсылка(), Справочники.СерииНоменклатуры.ПустаяСсылка());
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		ТекстСообшения = СтрШаблон(НСтр("ru = 'Сделка замена в %1 документах'"), Выборка.Количество());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообшения);
	Исключение
		ОтменитьТранзакцию();
		
		ТекстСообшения = СтрШаблон(НСтр("ru = 'Не удалось заменить сделку в документе %1. %2'"), Выборка.РегистраторПредставление, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообшения);
		
		ВызватьИсключение НСтр("ru = 'Не удалось выполнить замену сделки'");
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменитьСделку(ДокументОбъект, Сделка, СделкаЗамена)
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	ИменаТабличныхЧастейАкцизы = Новый Массив;
	ИменаТабличныхЧастейАкцизы.Добавить("БанковскиеГарантии");
	ИменаТабличныхЧастейАкцизы.Добавить("бг_АкцизПоПриобретеннымЦенностям");
	ИменаТабличныхЧастейАкцизы.Добавить("бг_АкцизПоПриобретеннымЦенностямМатериалы");
	ИменаТабличныхЧастейАкцизы.Добавить("бг_АкцизПоПриобретеннымЦенностямПродукция");
	
	Для Каждого ИмяТабличнойЧасти Из ИменаТабличныхЧастейАкцизы Цикл
		Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеДокумента.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("Сделка") = Неопределено Тогда
			ИмяПоля = "БанковскаяГарантия";
		Иначе
			ИмяПоля = "Сделка";
		КонецЕсли;
		
		Отбор = Новый Структура(ИмяПоля, Сделка);
		СтрокиЗаменитьСделку = ДокументОбъект[ИмяТабличнойЧасти].НайтиСтроки(Отбор);
		Для Каждого СтрокаТабличнаяЧасть Из СтрокиЗаменитьСделку Цикл
			СтрокаТабличнаяЧасть[ИмяПоля] = СделкаЗамена;
		КонецЦикла;
	КонецЦикла;
	
	ВыполнитьДополнительныеОперацииЗаменаСделки(ДокументОбъект, Сделка, СделкаЗамена);
	ДокументОбъект.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДополнительныеОперацииЗаменаСделки(ДокументОбъект, Сделка, СделкаЗамена)
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриобретениеТоваровУслуг") Тогда
		ДокументОбъект.бг_ДиапазонБанковскихГарантий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СделкаЗамена, "Родитель");
	Иначе
		ДокументОбъект.ДополнительныеСвойства.Вставить("адаптер_ЭтоГрупповаяОбработкаДанных", Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаменитьСделкуДвижения(Документ, Сделка, СделкаЗамена)
	НаборЗаписей = РегистрыНакопления.бг_АкцизПоПриобретеннымЦенностям.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ);
	НаборЗаписей.Прочитать();
	
	Для Каждого СтрокаНабор Из НаборЗаписей Цикл
		Если СтрокаНабор.Сделка = Сделка Тогда
			СтрокаНабор.Сделка = СделкаЗамена;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПересчетДвижений");
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсключаемыеТипыДокументовЗаменаСделки()
	ИсключаемыеТипыДокументов = Новый Массив;
	ИсключаемыеТипыДокументов.Добавить(Тип("ДокументСсылка.КорректировкаРегистров"));
	ИсключаемыеТипыДокументов.Добавить(Тип("ДокументСсылка.битРасчетАвансовПоАкцизам"));
	ИсключаемыеТипыДокументов.Добавить(Тип("ДокументСсылка.бг_РегистрацияБанковскихГарантий"));
	
	Возврат ИсключаемыеТипыДокументов;
КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьДвиженияНаСервере(ТипОбъектов, Организация, НачалоПериода, КонецПериода)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДокументыФормированиеДвижений(ТипОбъектов);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Обработки.бг_АктуализацияДвиженийПоАкцизам.СформироватьДвиженияПоАкцизам(Выборка);
КонецПроцедуры

&НаСервере
Процедура СформироватьДвиженияПоДнямНаСервере(Организация, НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Запрос.Текст = ТекстЗапросаФормированиеДвиженийПоДням();
	РезультатЗапроса = Запрос.Выполнить();
	
	Обработки.бг_АктуализацияДвиженийПоАкцизам.СформироватьДвиженияПоАкцизамПоДням(РезультатЗапроса);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДокументыФормированиеДвижений(ТипОбъектов)
	ТекстЗапроса = "";
	
	ШаблонТекстЗапросаТипДокумента = "ВЫБРАТЬ
	|	Документ.Ссылка КАК Регистратор,
	|	Документ.Дата КАК ДатаДокумента,
	|	Документ.Проведен КАК Проведен,
	|	Представление(Документ.Ссылка) КАК РегистраторПредставление
	|ИЗ
	|	Документ.%1 КАК Документ
	|ГДЕ
	|	(&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ Документ.Организация = &Организация)
	|	И Документ.Дата >= &НачалоПериода
	|	И (Документ.Дата <= &КонецПериода
	|			ИЛИ &КонецПериода = ДАТАВРЕМЯ(1, 1, 1))";
	
	Для Каждого ТипОбъекта Из ТипОбъектов.Типы() Цикл
		МетаданныеДокумент = Метаданные.НайтиПоТипу(ТипОбъекта);
		
		Если Не ОбщегоНазначения.ЭтоДокумент(МетаданныеДокумент) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗапросаТипДокумента = СтрШаблон(ШаблонТекстЗапросаТипДокумента, МетаданныеДокумент.Имя);
		
		ТекстЗапроса = ТекстЗапроса
						+ ?(ПустаяСтрока(ТекстЗапроса), "", ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина))
						+ ТекстЗапросаТипДокумента;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента";
	
	Возврат ТекстЗапроса;
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаФормированиеДвиженийПоДням()

	ДокументыСДвижениемСпирта = Новый Соответствие;
	ДокументыСДвижениемСпирта.Вставить("ТаможеннаяДекларацияИмпорт.Товары", "1");
	ДокументыСДвижениемСпирта.Вставить("ПоступлениеТоваровНаСклад.Товары", "2");
	ДокументыСДвижениемСпирта.Вставить("ДвижениеПродукцииИМатериалов.Товары", 
		"ВЫБОР 
		|		КОГДА Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую) 
		|			ТОГДА 3 
		|		ИНАЧЕ 5
		|	КОНЕЦ");
	ДокументыСДвижениемСпирта.Вставить("ПроизводствоБезЗаказа.МатериалыИРаботы", "3");
	ДокументыСДвижениемСпирта.Вставить("ЭтапПроизводства2_2.РасходМатериаловИРабот", "4");
	ДокументыСДвижениемСпирта.Вставить("ВнутреннееПотреблениеТоваров.Товары", "6");
	ДокументыСДвижениемСпирта.Вставить("ЗаявлениеОВвозеТоваров.Товары", "9");
	
	ДокументыСДвижениемГП= Новый Соответствие;
	ДокументыСДвижениемГП.Вставить("ВозвратТоваровОтКлиента.Товары", "1");
	ДокументыСДвижениемГП.Вставить("РеализацияТоваровУслуг.Товары", "7");
	ДокументыСДвижениемГП.Вставить("КорректировкаРеализации.Товары", "8");
	
	ТекстЗапроса = "";

	ШаблонТекстаДляСпирта = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Ссылка) КАК РегистраторПредставление,
	|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, День) КАК Дата,
	|	%2 КАК Приоритет
	|ИЗ
	|	Документ.%1 КАК Документ
	|ГДЕ
	|	Документ.Ссылка.Проведен
	|	И &Организация В (Документ.Ссылка.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И Документ.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Документ.Ссылка.Организация.бг_ВестиУчетАкцизовПоПриобретеннымЦенностям
	|	И Документ.Ссылка.Дата >= Документ.Ссылка.Организация.бг_ДатаНачалаУчетаАкцизовПоПриобретеннымЦенностям
	|	И Документ.Номенклатура.ВидАлкогольнойПродукции.ВидЛицензии = ЗНАЧЕНИЕ(Перечисление.ВидыЛицензийАлкогольнойПродукции.Спирт)";
	
	ШаблонТекстаДляПродукции = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Документ.Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Документ.Ссылка) КАК РегистраторПредставление,
	|	НАЧАЛОПЕРИОДА(Документ.Ссылка.Дата, День) КАК Дата,
	|	%2 КАК Приоритет
	|ИЗ
	|	Документ.%1 КАК Документ
	|ГДЕ
	|	Документ.Ссылка.Проведен
	|	И Документ.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Документ.Ссылка.Организация = Документ.Серия.ПроизводительЕГАИС.Контрагент
	|	И Документ.Ссылка.Организация.бг_ВестиУчетАкцизовПоПриобретеннымЦенностям
	|	И Документ.Ссылка.Дата >= Документ.Ссылка.Организация.бг_ДатаНачалаУчетаАкцизовПоПриобретеннымЦенностям";

	Для каждого Элемент Из ДокументыСДвижениемСпирта Цикл
		ТекстЗапросаДокумент = СтрШаблон(ШаблонТекстаДляСпирта, Элемент.Ключ, Элемент.Значение);
		
		Если Элемент.Ключ = "ЭтапПроизводства2_2" Тогда
			ТекстЗапросаДокумент = СтрЗаменить(ТекстЗапросаДокумент, "Ссылка.Дата", "ДатаПроизводства");
		КонецЕсли;

		ТекстЗапроса = ТекстЗапроса
			+ ?(ПустаяСтрока(ТекстЗапроса), "", ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина))
			+ ТекстЗапросаДокумент;
	КонецЦикла;

	Для каждого Элемент Из ДокументыСДвижениемГП Цикл
		ТекстЗапросаДокумент = СтрШаблон(ШаблонТекстаДляПродукции, Элемент.Ключ, Элемент.Значение);

		ТекстЗапроса = ТекстЗапроса
			+ ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()
			+ ТекстЗапросаДокумент;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата, Приоритет 
	|ИТОГИ ПО
	|	Дата";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти
